In [1]:
import pandas as pd
import os, time,json
import tmdbsimple as tmdb
from tqdm.notebook import tqdm_notebook

from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

FOLDER = "Data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

['title_basics_cleaned.csv.gz',
 'title.akas.tsv.gz',
 'final_tmdb_data_[2010, 2021].csv.gz',
 'title.ratings (1).tsv',
 'years_to_get.csv.gz',
 'tmdb_api_results_[2015, 2021].json',
 'ratings.akas.tsv.gz',
 'tmdb_api_results_2000.json',
 'final_tmdb_data_2000.csv.gz',
 'title_basics.csv.gz',
 'tmdb_api_results_[2000, 2001].json',
 'tmdb_api_results_[2010, 2021].json',
 'final_tmdb_data_[2000, 2001].csv.gz',
 'ratings_cleaned.akas.tsv.gz',
 '.ipynb_checkpoints',
 "tmdb_api_results_['2000'].json",
 'title.akas_cleaned.tsv.gz']

In [2]:
import json
with open('/Users/christinab/.secret/tmdb_api.json', 'r') as f:
    login = json.load(f)
## Display the keys of the loaded dict
login.keys()

dict_keys(['client-id', 'Api-key'])

In [3]:
#make a movie object using the .Movies function from tmdb
tmdb.API_Key = login['Api-key']

In [4]:
# list of tables needed for imports
# title_basics
# title_ratings
# title_genres
# genres
# tmdb_data

#### Table 1

In [5]:
#load dataframe from project part 1 as basics:
basics = pd.read_csv('Data/title_basics_cleaned.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0119830,movie,One Dog Day,One Dog Day,0,2022,NaN,101,"Action,Comedy"
1,tt0120589,movie,A Dangerous Practice,A Dangerous Practice,0,2022,NaN,108,Drama
2,tt0200940,movie,Over-sexed Rugsuckers from Mars,Over-sexed Rugsuckers from Mars,0,2022,NaN,87,"Comedy,Sci-Fi"
3,tt0283145,movie,Wielka droga,Wielka droga,0,2022,NaN,87,"Drama,War"
4,tt0326716,movie,5-25-77,'77,0,2022,NaN,132,"Comedy,Drama"

**List of Unique Genres**

In [6]:
# create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics.head(3)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0119830,movie,One Dog Day,One Dog Day,0,2022,NaN,101,"Action,Comedy","[Action, Comedy]"
1,tt0120589,movie,A Dangerous Practice,A Dangerous Practice,0,2022,NaN,108,Drama,[Drama]
2,tt0200940,movie,Over-sexed Rugsuckers from Mars,Over-sexed Rugsuckers from Mars,0,2022,NaN,87,"Comedy,Sci-Fi","[Comedy, Sci-Fi]"

In [7]:
# separate the genres col- variables into there individual row 
exploded_genres = basics.explode('genres_split')
exploded_genres.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0119830,movie,One Dog Day,One Dog Day,0,2022,NaN,101,"Action,Comedy",Action
0,tt0119830,movie,One Dog Day,One Dog Day,0,2022,NaN,101,"Action,Comedy",Comedy

In [8]:
# Get the string column converted to a list of strings in each row
genres_split = basics['genres'].str.split(',')

## Explore the series using.explore() and take the .unique() entires only.
unique_genres = genres_split.explode().unique()
unique_genres

array(['Action', 'Comedy', 'Drama', 'Sci-Fi', 'War', 'Crime', 'Thriller',
       'Horror', 'Mystery', 'Romance', 'Adventure', 'Animation',
       'History', 'Biography', 'Family', 'Musical', 'Music', 'Fantasy',
       'Western', 'Sport', 'Reality-TV', 'News', 'Talk-Show', 'Adult',
       'Game-Show'], dtype=object)

In [9]:
# use the unique genres from the genres_split colummn 
unique_genres = sorted(exploded_genres['genres_split'].unique())

**Table 1**

In [10]:
# create a new title_genres table with only the 'tconst & genres_split' columns
# save as a new df

title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0119830       Action
0  tt0119830       Comedy
1  tt0120589        Drama
2  tt0200940       Comedy
2  tt0200940       Sci-Fi

**Create a genre mapper dictionary to replace string genres with INT**

In [11]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [12]:
# Make a dictionary with list of unique genres as the key and the new interger id as values
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [13]:
# make new interger genre_id and drop string genres
basics["genre_id"] = basics["genres"].map(genre_map)
basics = basics.drop(columns="genres")

**Table 2**

In [14]:
## Manaully make dataframe with named cols from the .keyd and .values
genre_lookup = pd.DataFrame({'Genre_Name': genre_id_map.keys(),
                            'Genre_ID': genre_id_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

**Table 3**

In [15]:
# load ratings dataframe 
ratings = pd.read_csv('Data/ratings_cleaned.akas.tsv.gz')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1923
1  tt0000002            5.8       260
2  tt0000003            6.5      1732
3  tt0000004            5.6       174
4  tt0000005            6.2      2544

**Table 4**

In [16]:
# load tmdb_data dataframe 
tmdb_data = pd.read_csv('Data/final_tmdb_data_[2000, 2001].csv.gz')
tmdb_data

   imdb_id
0        0

#### DataFrame to SQL

In [17]:
## loading mysql credentials 
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy_utils import create_database, database_exists

from urllib.parse import quote_plus as urlquote
import json 

with open('/Users/christinab/.secret/mysql.json') as f: 
    login=json.load(f)

login.keys()

dict_keys(['username', 'password'])

In [18]:
# connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movies_yr"
# engine = create_engine(connection)
# engine

connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movies_yr"
engine = create_engine(connection)

In [19]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created.')

It exists!

In [20]:
## Example 
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictionary using Sqlalchemy datatype objects
basics_schema = {
    'tconst': String(key_len+1),
    'primaryTitle': Text(title_len+1),
    'StartYear':Float(),
    'endYear':Float(),
    'runtimeMinutes': Integer()}

In [21]:
basics = basics.drop(columns=['genres_split', 'originalTitle', 'isAdult', 'genre_id', 'titleType'])

In [22]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7867 entries, 0 to 7866
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          7867 non-null   object
 1   primaryTitle    7867 non-null   object
 2   startYear       7867 non-null   int64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  7867 non-null   int64
dtypes: float64(1), int64(2), object(2)
memory usage: 307.4+ KB

In [23]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

7867

In [24]:
title_genres.to_sql('title_genres', engine,dtype=basics_schema,if_exists='replace', index=False)

12826

In [25]:
genre_lookup.to_sql('genres', engine,dtype=basics_schema,if_exists='replace', index=False)

25

In [26]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=basics_schema,if_exists='replace',index=False)

1243998

In [27]:
tmdb_data.to_sql('tmdb_data', engine,dtype=basics_schema,if_exists='replace',index=False )

1

In [28]:
q= '''SHOW TABLES'''
pd.read_sql(q, engine)

  Tables_in_movies_yr
0              genres
1        title_basics
2        title_genres
3       title_ratings
4           tmdb_data

In [29]:
q= '''SELECT * FROM title_basics'''
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0119830,One Dog Day,2022,None,101
1,tt0120589,A Dangerous Practice,2022,None,108
2,tt0200940,Over-sexed Rugsuckers from Mars,2022,None,87
3,tt0283145,Wielka droga,2022,None,87
4,tt0326716,5-25-77,2022,None,132
...,...,...,...,...,...
7862,tt9893130,"2025: Blood, White & Blue",2022,None,120
7863,tt9893158,Clowning,2022,None,96
7864,tt9893160,No Way Out,2022,None,89
7865,tt9894000,Twice As Strong: Made of Fire,2022,None,122
7866,tt9904648,The Contrast,2022,None,82

In [30]:
engine.execute("ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);")